/*******************************************************************************
Copyright 2008 - 2016 深圳市信盈达科技有限公司. All rights reserved.
文件名:       WatchInfo.h
描述   :      手表信息头文件
作者   :       Jahol Fan
版本   :       V1.0
修改   :   
完成日期：     2016.9.26
*******************************************************************************/
#ifndef __WATCH_INFO_H
#define __WATCH_INFO_H

#ifdef __cplusplus
extern "C"
{
#endif

/*********************************************************************
 * INCLUDES
 */
#include "stm32f4xx.h"
#include "stepAlgorithm.h"
/*********************************************************************
 * TYPEDEFS
 */
/*********************************************************************
*  EXTERNAL VARIABLES
*/

/*********************************************************************
 * CONSTANTS
 */
//软件版本为01.01.00
#define     SYS_VERSION       0x0101
#define     TEST_VERSION      0x00
/*********************************************************************
 * MACROS
 */

/*********************************************************************
 *PUBLIC FUNCTIONS DECLARE
 */
u8 WatchInfo_init(void);
u8 WatchInfo_setUserInfo(u8 height,u8 weight);
personInfo_t * WatchInfo_getUserInfo(u8 *error);



/*********************************************************************
*********************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* __WATCH_INFO_H */
